/**
=======================================================================================
------------------------------------ Problem 3-7-1 ------------------------------------
2개의 변수의 대소 관계를 다음과 같이 표시하는 프로그램을 작성하자.
- "x가 y보다 크다."
- "y가 y보다 작다."
- "x와 y가 같다."

----------------------------------------- 입력 -----------------------------------------
12
3

------------------------------------- 출력(실행결과) -------------------------------------
변수 x:
변수 y:
x가 y보다 크다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 읽은 정숫값의 대소 관계를 표시
import java.util.Scanner;

class Balance {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);
        System.out.print("변수 x: ");
        int x = stdIn.nextInt();
        System.out.print("변수 y: ");
        int y = stdIn.nextInt();
        stdIn.close();

        if (x > y) {
            System.out.println("x가 y보다 크다.");
        } else if (x < y) {
            System.out.println("x가 y보다 작다.");
        } else {
            System.out.println("x와 y가 같다.");
        }
    }
}
