/**
=======================================================================================
------------------------------------ Problem 3-7-2 ------------------------------------
Balance.java를 overflow시키고 틀린 결과값을 표시해보자.

----------------------------------------- 입력 -----------------------------------------
2147483647
-1
-2147483648
1

------------------------------------- 출력(실행결과) -------------------------------------
변수 x:
변수 y:
x가 y보다 작다.
--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 읽은 정숫값의 대소 관계를 표시(틀린 버전)
import java.util.Scanner;

class BalanceWrong {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);
        System.out.print("변수 x: ");
        int x = stdIn.nextInt();
        System.out.print("변수 y: ");
        int y = stdIn.nextInt();
        stdIn.close();

        if (x - y > 0) {
            System.out.println("x가 y보다 크다.");
        } else if (x - y < 0) {
            System.out.println("x가 y보다 작다.");
        } else {
            System.out.println("x와 y가 같다.");
        }
    }
}
