/**
=======================================================================================
------------------------------------- Problem 5-5 -------------------------------------
3개의 정숫값을 읽어서 합계와 평균을 구하는 프로그램을 작성하자.
평균은 정수 3으로 나누고 실수로 표시한다.

----------------------------------------- 입력 -----------------------------------------
7
8
10

------------------------------------- 출력(실행결과) -------------------------------------
정숫값 x, y, z의 평균을 구합니다.
x값:
y값:
z값:
x, y, z의 평균은 8.000입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap5.Solution;
import java.util.Scanner;

// 3개의 정숫값을 읽어서 평균을 실수로 표시(잘못된 버전)
class Average3Wrong {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.println("정숫값 x, y, z의 평균을 구합니다.");
        System.out.print("x값: ");
        int x = stdIn.nextInt();
        System.out.print("y값: ");
        int y = stdIn.nextInt();
        System.out.print("z값: ");
        int z = stdIn.nextInt();
        stdIn.close();

        double average = (x + y + z)/3;
        System.out.printf("x, y, z의 평균은 %.3f입니다.\n", average);
    }
}
