/**
 =======================================================================================
 ------------------------------------- Problem 11-2 ------------------------------------
 실수값을 읽어서 절대값과 제곱근을 구하자.
 해당 실수값이 반지름인 원의 넓이를 구해서 표시하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 오늘은 2023년 06월 16일 입니다.
 오늘의 운세는 대길입니다.

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap11.Solution;
import java.util.Scanner;
import static java.lang.Math.*;
import static java.lang.System.in;
import static java.lang.System.out;

public class MathMethods {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(in);
        out.print("실 수: ");
        double x = stdIn.nextDouble();

        out.println("절댓값: " + abs(x));
        out.println("절댓값: " + sqrt(x));
        out.println("절댓값: " + PI * x * x);
    }
}
