/**
 =======================================================================================
 ------------------------------------- Problem 16-2 ------------------------------------
 MulDiv1.java를 수정하자.
 정숫값의 곱과 몫을 구하고 출력하는 메서드를 작성한다.
 그리고 각각을 순차적으로 호출해서 결과를 표시한다.
 호출 과정에서 예외를 캐치한다.

 ----------------------------------------- 입력 -----------------------------------------
 7
 E

 ------------------------------------- 출력(실행결과) -------------------------------------
 x 값:
 y 값:
 입력 오류 발생.java.util.InputMismatchException
 프로그램을 종료합니다.

 --------------------------------------- 에러 내용 ---------------------------------------
 java.util.InputMismatchException
     at java.base/java.util.Scanner.throwFor(Scanner.java:939)
     at java.base/java.util.Scanner.next(Scanner.java:1594)
     at java.base/java.util.Scanner.nextInt(Scanner.java:2258)
     at java.base/java.util.Scanner.nextInt(Scanner.java:2212)
     at Chap16.Solution.MulDiv2.main(MulDiv2.java:49)

 =======================================================================================
 */
