/**
=======================================================================================
------------------------------------ Problem 2-4-2 ------------------------------------
3개의 int형 변수에 각각 값을 대입해서 합계와 평균을 구하는 프로그램을 작성하자.
합계는 sum에 저장한다.

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
x값은 63입니다.
y값은 18입니다.
z값은 52입니다.
합계는 133입니다.
평균은 44입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap2.Solution;

// 3개의 변수 x, y, z의 합과 평균을 표시(방법2)
class SumAve3B {
    public static void main(String[] args) {
        int x, y, z, sum;
        x = 63;
        y = 18;
        z = 52;
        sum = x + y + z;
        
        System.out.println("x값은 " + x + "입니다.");
        System.out.println("y값은 " + y + "입니다.");
        System.out.println("z값은 " + z + "입니다.");
        System.out.println("합계는 " + sum + "입니다.");
        System.out.println("평균은 " + (sum / 3) + "입니다.");
    }
}
