/**
=======================================================================================
------------------------------------- Problem 9-7 -------------------------------------
Period 클래스를 작성하자.

--- Period 클래스 ---
변수
    1) 시작일(날짜)
    2) 종료일(날짜)

메서드
    1) getter
    2) 문자열 변환

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
없음

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
public class Period {
    private Day from;
    private Day to;

    public Period(Day from, Day to) {
        this.from = new Day(from);
        this.to = new Day(to);
    }

    public Day getFrom() {
        return new Day(from);
    }
    public Day getTo() {
        return new Day(to);
    }

    public String toString() {
        return "{" + from + "~" +  to + "}";
    }
}
