/**
=======================================================================================
------------------------------------- Problem 1-2 -------------------------------------
프로그램 내에서 실행문 끝에 세미콜론(;)을 빼면 어떤 일이 발생할까?
Hello.java 프로그램을 컴파일해서 알아보자.

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
컴파일 오류가 발생해서 실행되지 않음

--------------------------------------- 에러 내용 ---------------------------------------
HelloError.java:17: error: ';' expected
        System.out.println("첫 Java 프로그램입니다.")
                                             ^
HelloError.java:18: error: ';' expected
        System.out.println("화면에 출력하고 있습니다.")
                                            ^
2 errors
=======================================================================================
*/
package Chap1.Solution;

// 화면에 출력하는 프로그램(오류: 세미콜론 누락)
class HelloError {
    public static void main(String[] args) {
//        System.out.println("첫 Java 프로그램입니다.")
//        System.out.println("화면에 출력하고 있습니다.")
    }
}
