/**
 =======================================================================================
 ------------------------------------- Problem 15-4 ------------------------------------
 문자열을 읽어서 그 문자열을 역순으로 표시하는 프로그램을 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 AB감자

 ------------------------------------- 출력(실행결과) -------------------------------------
 문자열:
 반대로 읽으면 자감BA입니다.

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap15.Solution;
import java.util.Scanner;

public class ScanStringRev {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("문자열: ");
        String s = stdIn.next();

        System.out.print("반대로 읽으면 ");
        for (int i = s.length() - 1; i >= 0; i--) {
            System.out.print(s.charAt(i));
        }
        System.out.println("입니다.");
    }
}
