/**
 =======================================================================================
 ------------------------------------- Problem 15-3 ------------------------------------
 String 형 변수를 비교해보자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 s1 = null
 s2 =
 s3 = ABC
 s4 = ABC
 s5 = XYZ
 s3과 s4는 같은 문자열 리터럴을 참조하고 있다.

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap15.Solution;

public class StringTester {
    public static void main(String[] args) {
        String s1 = null;
        String s2 = "";
        String s3 = "ABC";
        String s4 = "ABC";
        String s5 = "ABC";
        s5 = "XYZ";

        System.out.println("s1 = " + s1);
        System.out.println("s2 = " + s2);
        System.out.println("s3 = " + s3);
        System.out.println("s4 = " + s4);
        System.out.println("s5 = " + s5);
        System.out.println("s3과 s4는 같은 문자열 리터럴을 참조하고 있다.");
    }
}
