/**
=======================================================================================
------------------------------------- Problem 2-3 -------------------------------------
SumAve1.java와 동일한 프로그램의 변수 x, y에 실숫값을 대입하고 그 결과를 알아보자.

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
컴파일 오류가 발생해서 실행되지 않음

--------------------------------------- 에러 내용 ---------------------------------------
SumaveError.java:20: error: incompatible types: possible lossy conversion from double 
to int
        x = 63.4;
            ^
SumaveError.java:21: error: incompatible types: possible lossy conversion from double 
to int
        y = 18.3;
            ^
2 errors

=======================================================================================
*/
