/**
 =======================================================================================
 ------------------------------------- Problem 16-1 ------------------------------------
 입력한 두 정숫값의 곱과 몫을 구하는 프로그램을 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 7
 5

 ------------------------------------- 출력(실행결과) -------------------------------------
 x 값:
 y 값:
 x * y = 35
 x / y = 1

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap16.Solution;
import java.util.Scanner;

public class MulDiv1 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("x 값: ");
        int x = stdIn.nextInt();
        System.out.print("y 값: ");
        int y = stdIn.nextInt();
        stdIn.close();

        System.out.println("x * y = " + (x * y));
        System.out.println("x / y = " + (x / y));
    }
}
