/**
 =======================================================================================
 ------------------------------------- Problem 16-5 ------------------------------------
 2개의 정수를 덧셈하는 메서드를 작성한다.
 더할 값과 연산 결과가 모두 한 자리가 되도록 하는 것이 전제이다.
 그렇지 않은 경우에는 예외를 발생시킨다.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 없음

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap16.Solution;

public class RangeError extends RuntimeException {
    RangeError(int n) {
        super("범위 밖 값: " + n);
    }

    static class ParameterRangeError extends RangeError {
        ParameterRangeError(int n) {
            super(n);
        }
    }

    static class ResultRangeError extends RangeError {
        ResultRangeError(int n) {
            super(n);
        }
    }
}
