/**
 =======================================================================================
 ------------------------------------- Problem 12-4 ------------------------------------
 ExCar를 참조한 Car3 인스턴스를 생성하고 사용하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 x 구입일: 2015년 12월 24일(목)
 y 구입일: 2015년 12월 24일(목)
 y의 총 주행 거리: 0.0

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap12.Solution;
import Chap9.Solution.Day1;

public class CarTester1 {
    public static void main(String[] args) {
        Car2 car1 = new Car2(
                "W221", 1885, 1490,
                5220, 95.0,
                new Day1(2018, 10, 13)
        );
        ExCar car2 = new ExCar(
                "W221", 1845, 1490,
                5205, 90.0,
                new Day1(2015, 12, 24)
        );

        Car2 x;
        x = car1;
        x = car2;

        System.out.println("x 구입일: " + x.getPurchaceDay());

        ExCar y;
//        y = car1;
        y = car2;

        System.out.println("y 구입일: " + y.getPurchaceDay());
        System.out.println("y의 총 주행 거리: " + y.getTotalMileage());
    }
}
