/**
 =======================================================================================
 ------------------------------------- Problem 12-2 ------------------------------------
 ExCar.java의 ExCar 클래스의 인스턴스를 만들어 현재 위치와 남은 연료량, 구입일을 표시하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 현재 위치: (0.00, 0.00)
 남은 연료: 90.00리터
 구 입 일: 2015년 12월 24일(목)

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap12.Solution;
import Chap9.Solution.Day1;

public class ExCarTester1 {
    public static void main(String[] args) {
        ExCar myCar = new ExCar("W221", 1845, 1490,
                5205, 90.0, new Day1(2015, 12, 24));
        System.out.printf("현재 위치: (%.2f, %.2f)\n", myCar.getX(), myCar.getY());
        System.out.printf("남은 연료: %.2f리터\n", myCar.getFuel());
        System.out.printf("구 입 일: %s\n", myCar.getPurchaceDay());
    }
}
