/**
 =======================================================================================
 ------------------------------------- Problem 10-6 ------------------------------------
 실숫값을 읽어서 절댓값과 제곱근을 구하고, 해당 값을 반지름으로 하는 원의 면적을 구하자.

 ----------------------------------------- 입력 -----------------------------------------
 5.5

 ------------------------------------- 출력(실행결과) -------------------------------------
 실수값:
 Math.abs(x) = 5.5
 Math.sqrt(x) = 2.345207879911715
 Math.PI * x * x = 95.03317777109123

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap10.Solution;
import java.util.Scanner;

public class MathMethods {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("실수값: ");
        double x = stdIn.nextDouble();

        System.out.println("Math.abs(x) = " + Math.abs(x));
        System.out.println("Math.sqrt(x) = " + Math.sqrt(x));
        System.out.println("Math.PI * x * x = " + Math.PI * x * x);
    }
}
