/**
=======================================================================================
------------------------------------ Problem 3-2-2 ------------------------------------
Absolute1.java를 Math 함수를 사용해서 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
-35

------------------------------------- 출력(실행결과) -------------------------------------
정숫값:
절댓값은 35입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 정숫값을 읽어서 절댓값을 표시(방법2: Math 함수)
class Absolute2 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);
        
        System.out.print("정숫값: ");
        int x = stdIn.nextInt();
        stdIn.close();

        System.out.println("절댓값은 " + Math.abs(x) + "입니다.");
    }
}
