/**
=======================================================================================
------------------------------------ Problem 3-14-2 -----------------------------------
Diff2Digits2.java를 조건 연산자를 사용해서 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
35
23

------------------------------------- 출력(실행결과) -------------------------------------
정수 x:
정수 y:
두 값의 차는 10 초과입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 2 개의 정숫값을 읽어서 차를 표시(방법2: 조건 연산자)
class Diff2Digits2 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("정수 x: ");
        int x = stdIn.nextInt();
        System.out.print("정수 y: ");
        int y = stdIn.nextInt();
        stdIn.close();

        int diff = x > y ? x - y : y - x;
        System.out.println("두 값의 차는 10" + (diff <= 10 ? "이하" : "초과") + "입니다.");
    }
}
