/**
=======================================================================================
------------------------------------- Problem 3-20 ------------------------------------
Switch문을 사용해 난수를 생성해서 가위바위보를 표시하는 프로그램을 작성하자.
- 난수: 0, 1, 2
- 0: "가위", 1: "바위", 2: "보"

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
컴퓨터가 낸 것: 바위

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Random;

// 생성된 난수에 따라 가위바위보 중 하나를 표시
class FingerFlashing {
    public static void main(String[] args) {
        Random rand = new Random();

        System.out.print("컴퓨터가 낸 것: ");
        int x = rand.nextInt(3);

        switch(x) {
            case 0:
                System.out.println("가위");
                break;
            case 1:
                System.out.println("바위");
                break;
            case 2:
                System.out.println("보");
                break;
        }
    }
}
