/**
=======================================================================================
------------------------------------ Problem 3-11-1 -----------------------------------
논리곱 연산자(&&)를 사용해서 입력한 점수에 따라 수/우/미/양/가를 판정하는 프로그램을 작성하자.
- "수": 80점 이상 100점 이하
- "우": 70점 이상 79점 이하
- "미": 60점 이상 69점 이하
- "양": 50점 이상 59점 이하
- "가": 0점 이상 49점 이하
- "잘못된 점수입니다.": 0점 미만 혹은 100점 초과

----------------------------------------- 입력 -----------------------------------------
-1

------------------------------------- 출력(실행결과) -------------------------------------
점수:
잘못된 점수입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 점수를 기준으로 성적 판정(방법1: 논리곱 연산자(&&)를 이용)
class Grade1 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("점수: ");
        int x = stdIn.nextInt();
        stdIn.close();

        if (80 <= x && x <= 100) {
            System.out.println("수");
        } else if (70 <= x && x <= 79) {
            System.out.println("우");
        } else if (60 <= x && x <= 69) {
            System.out.println("미");
        } else if (50 <= x && x <= 59) {
            System.out.println("양");
        } else if (0 <= x && x <= 49) {
            System.out.println("가");
        } else {
            System.out.println("잘못된 점수입니다.");
        }
    }
}
