/**
=======================================================================================
------------------------------------- Problem 3-4 -------------------------------------
Measure1.java를 논리 부정 연산자(!)를 사용해서 수정하자.

----------------------------------------- 입력 -----------------------------------------
12
5

------------------------------------- 출력(실행결과) -------------------------------------
변수 x:
변수 y:
y는 x의 약수가 아닙니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 읽은 정숫값이 약수인지 판별(논리 부정 연산자)
class Measure2 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("변수 x: ");
        int x = stdIn.nextInt();
        System.out.print("변수 y: ");
        int y = stdIn.nextInt();
        stdIn.close();

        if (!(x % y == 0)) {
            System.out.println("y는 x의 약수가 아닙니다.");
        } else {
            System.out.println("y는 x의 약수입니다.");
        }
    }
}
