/**
=======================================================================================
------------------------------------- Problem 3-1 -------------------------------------
키보드로 입력한 정숫값이 음이면 "이 값은 음의 값입니다." 라고 표시하는 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
-10

------------------------------------- 출력(실행결과) -------------------------------------
정숫값:
이 값은 음의 값입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 읽은 정숫값이 음의 값인지 판단
class Negative {
    public static void main(String[] args) {
        Scanner stdin = new Scanner(System.in);

        System.out.print("정숫값: ");
        int x = stdin.nextInt();
        stdin.close();

        if (x < 0) {
            System.out.println("이 값은 음의 값입니다.");
        }
    }
}
