/**
=======================================================================================
------------------------------------- Problem 3-5 -------------------------------------
정숫값을 읽어 부호(양수/음수/0)를 판정하는 프로그램을 작성하자.
- "값이 양수입니다."
- "값이 음수입니다."
- "값이 0입니다."

----------------------------------------- 입력 -----------------------------------------
0

------------------------------------- 출력(실행결과) -------------------------------------
정숫값:
값이 0입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 읽은 정숫값의 부호(양수/음수/0)를 판정해서 표시
class Sign1 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("정숫값: ");
        int x = stdIn.nextInt();
        stdIn.close();

        if (x > 0) {
            System.out.println("값이 양수입니다.");
        } else if (x < 0) {
            System.out.println("값이 음수입니다.");
        } else {
            System.out.println("값이 0입니다.");
        }
    }
}
