/**
=======================================================================================
------------------------------------- Problem 3-18 ------------------------------------
입력한 2개의 정숫값을 내림차순(큰 순)으로 정렬하는 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
13
57

------------------------------------- 출력(실행결과) -------------------------------------
정수 x:
정수 y:
x>=y가 되도록 정렬했습니다.
변수 x는 57입니다.
변수 y는 13입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap3.Solution;
import java.util.Scanner;

// 두 정숫값을 읽어서 내림차순(큰 순)으로 정렬
class Sort2Descending {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("정수 x: ");
        int x = stdIn.nextInt();
        System.out.print("정수 y: ");
        int y = stdIn.nextInt();
        stdIn.close();

        int temp;
        if (x < y) {
            temp = y;
            y = x;
            x = temp;
        }

        System.out.println("x>=y가 되도록 정렬했습니다.");
        System.out.println("변수 x는 " + x + "입니다.");
        System.out.println("변수 y는 " + y + "입니다.");
    }
}
