/**
=======================================================================================
------------------------------------- Problem 9-7 -------------------------------------
Period 클래스를 작성하자.

--- Period 클래스 ---
변수
    1) 시작일(날짜)
    2) 종료일(날짜)

메서드
    1) getter
    2) 문자열 변환

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
없음

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap9.Solution;

public class Period {
    private Day1 from;
    private Day1 to;

    public Period(Day1 from, Day1 to) {
        this.from = new Day1(from);
        this.to = new Day1(to);
    }

    public Day1 getFrom() {
        return new Day1(from);
    }
    public Day1 getTo() {
        return new Day1(to);
    }

    public String toString() {
        return "{" + from + "~" +  to + "}";
    }
}
