/**
 =======================================================================================
 ------------------------------------- Problem 14-6 ------------------------------------
 ExPlayer를 구현한 DVDPlayer 클래스를 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 없음

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap14.Solution;

public class DVDPlayer implements ExPlayer {
    @Override
    public void slow() {
        System.out.println("DVD 느린 재생 시작!");
    }

    @Override
    public void play() {
        System.out.println("DVD 재생 시작!");
    }

    @Override
    public void stop() {
        System.out.println("DVD 재생 종료!");
    }
}
