/**
 =======================================================================================
 ------------------------------------- Problem 14-1 ------------------------------------
 Wearable 인터페이스를 구현한 Headphone 클래스를 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 없음

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap14.Solution;

public class Headphone implements Wearable {
    int volume = 0;

    @Override
    public void putOn() {
        System.out.println("헤드폰을 착용했습니다.");
    }

    @Override
    public void putOff() {
        System.out.println("헤드폰을 벗었습니다.");
    }

    public void setVolume(int volume) {
        this.volume = volume;
        System.out.println("볼륨을" + volume + "로 변경했습니다.");
    }
}
