/**
 =======================================================================================
 ------------------------------------- Problem 14-1 ------------------------------------
 Wearable 인터페이스를 구현한 WearableComputer 클래스를 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 없음

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap14.Solution;

public class WearableComputer implements Wearable {
    @Override
    public void putOn() {
        System.out.println("컴퓨터를 실행했습니다.");
    }

    @Override
    public void putOff() {
        System.out.println("컴퓨터를 껐습니다.");
    }

    public void reset() {
        System.out.println("컴퓨터를 재시작했습니다.");
    }
}
