/**
 =======================================================================================
 ------------------------------------- Problem 14-1 ------------------------------------
 Wearable 인터페이스를 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 헤드폰을 착용했습니다.
 컴퓨터를 실행했습니다.
 헤드폰을 벗었습니다.
 컴퓨터를 껐습니다.

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap14.Solution;

public class WearableTester {
    public static void main(String[] args) {
        Wearable[] a = new Wearable[2];
        a[0] = new Headphone();
        a[1] = new WearableComputer();

        for (int i = 0; i < a.length; i++) {
            a[i].putOn();
        }
        for (int i = 0; i < a.length; i++) {
            a[i].putOff();
        }
    }
}
