/**
=======================================================================================
------------------------------------- Problem 2-15 ------------------------------------
입력한 주소를 표시하는 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
서울특별시 마포구

------------------------------------- 출력(실행결과) -------------------------------------
주소:
주소는 서울특별시 마포구입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 주소를 읽어서 표시
import java.util.Scanner;

class Address {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("주소: ");
        String address = stdIn.nextLine();
        stdIn.close();

        System.out.println("주소는 " + address + "입니다.");
    }
}
