/**
=======================================================================================
------------------------------------- Problem 2-10 ------------------------------------
구의 겉넓이와 부피를 구하는 프로그램을 작성하자.
원주율 3.1416은 final 변수를 사용한다.

----------------------------------------- 입력 -----------------------------------------
12.5

------------------------------------- 출력(실행결과) -------------------------------------
구의 겉넓이와 부피를 구합니다.
반지름: [입력]
겉넓이는 1963.4999999999998입니다.
부피는 8181.249999999998입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 구의 부피와 겉넓이 구하기
import java.util.Scanner;

class Globe {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);
        final double pi = 3.1416;

        System.out.println("구의 겉넓이와 부피를 구합니다.");

        System.out.print("반지름: ");
        double r = stdIn.nextDouble();
        stdIn.close();

        System.out.println("겉넓이는 " + (4 * pi * r * r) + "입니다.");
        System.out.println("부피는 " + ((4 / 3.0) * pi * r * r * r) + "입니다.");
    }
}
