/**
=======================================================================================
------------------------------------- Problem 2-16 ------------------------------------
String 형의 변수를 문자열로 초기화하거나 변수에 문자열을 대입하는 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
문자열 s1은 ABC입니다.
문자열 s2는 XYZ입니다.
문자열 s1은 FBI입니다.
문자열 s2는 XYZ입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 문자열 초기화와 대입
class StringTester {
    public static void main(String[] args) {
        String s1 = "ABC";
        String s2 = "XYZ";

        System.out.println("문자열 s1은 " + s1 + "입니다.");
        System.out.println("문자열 s2는 " + s2 + "입니다.");

        s1 = "FBI";

        System.out.println("문자열 s1은 " + s1 + "입니다.");
        System.out.println("문자열 s2는 " + s2 + "입니다.");        
    }
}
