/**
=======================================================================================
------------------------------------ Problem 2-4-3 ------------------------------------
SumAve3B.java에서 변수의 생성과 초기화를 동시에 진행해보자.

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
x값은 63입니다.
y값은 18입니다.
z값은 52입니다.
합계는 133입니다.
평균은 44입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 3개의 변수 x, y, z의 합과 평균을 표시(방법3)
class SumAve3C {
    public static void main(String[] args) {
        int x = 63;
        int y = 18;
        int z = 52;
        int sum = x + y + z;
        
        System.out.println("x값은 " + x + "입니다.");
        System.out.println("y값은 " + y + "입니다.");
        System.out.println("z값은 " + z + "입니다.");
        System.out.println("합계는 " + sum + "입니다.");
        System.out.println("평균은 " + (sum / 3) + "입니다.");
    }
}
