/**
=======================================================================================
------------------------------------ Problem 2-4-1 ------------------------------------
3개의 int형 변수에 각각 값을 대입해서 합계와 평균을 구하는 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
없음

------------------------------------- 출력(실행결과) -------------------------------------
x값은 63입니다.
y값은 18입니다.
z값은 52입니다.
합계는 133입니다.
평균은 44입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 3개의 변수 x, y, z의 합과 평균을 표시(방법1)
class SumAve3A {
    public static void main(String[] args) {
        int x, y, z;
        x = 63;
        y = 18;
        z = 52;
        
        System.out.println("x값은 " + x + "입니다.");
        System.out.println("y값은 " + y + "입니다.");
        System.out.println("z값은 " + z + "입니다.");
        System.out.println("합계는 " + (x + y + z) + "입니다.");
        System.out.println("평균은 " + ((x + y + z) / 3) + "입니다.");
    }
}
