/**
=======================================================================================
------------------------------------- Problem 4-1 -------------------------------------
Chap3의 Sign1.java를 반복해서 입력 및 표시하도록 작성하자.

----------------------------------------- 입력 -----------------------------------------
0

------------------------------------- 출력(실행결과) -------------------------------------
정숫값:
값이 0입니다.
다시 한 번? 1-Yes/0-No:

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 읽은 정숫값의 부호(양수/음수/0)를 판정해서 표시(원하는 만큼 반복)
import java.util.Scanner;

class Sign1 {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("정숫값: ");
        int x = stdIn.nextInt();

        int retry;
        do {
            if (x > 0) {
                System.out.println("값이 양수입니다.");
            } else if (x < 0) {
                System.out.println("값이 음수입니다.");
            } else {
                System.out.println("값이 0입니다.");
            }
            System.out.print("다시 한 번? 1-Yes/0-No: ");
            retry = stdIn.nextInt();
        } while(retry == 1);
        stdIn.close();
    }
}
