/**
=======================================================================================
------------------------------------- Problem 5-3 -------------------------------------
float형 변수와 double형 변수에 실숫값을 읽어서 표시하는 프로그램을 작성하자.

----------------------------------------- 입력 -----------------------------------------
0.12345678901234567890
0.12345678901234567890

------------------------------------- 출력(실행결과) -------------------------------------
실수 x(float):
실수 y(double):
x = 0.12345679
y = 0.12345678901234568

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
// 8진수, 10진수, 16진수 12를 각각 10진수로 표시
import java.util.Scanner;

class FloatDoubleScanPrint {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("실수 x(float): ");
        float x = stdIn.nextFloat();
        System.out.print("실수 y(double): ");
        double y = stdIn.nextDouble();
        stdIn.close();

        System.out.println("x = " + x); // 정밀도: 약 6~7자리
        System.out.println("y = " + y); // 정밀도: 약 15자리
    }
}
