/**
 =======================================================================================
 ------------------------------------- Problem 4-5 -------------------------------------
 입력받은 정숫값부터 0까지 카운트다운하는 프로그램을 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 3

 ------------------------------------- 출력(실행결과) -------------------------------------
 카운트다운 합니다.
 양의 정숫값:
 3
 x의 값이2이 됐습니다.
 2
 x의 값이1이 됐습니다.
 1
 x의 값이0이 됐습니다.
 0
 x의 값이-1이 됐습니다.

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap4.Solution;
import java.util.Scanner;

// 양의 정숫값을 0까지 카운트다운
public class CountDown {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.println("카운트다운 합니다.");
        int x;
        do {
            System.out.print("양의 정숫값: ");
            x = stdIn.nextInt();
        } while (x <= 0);
        stdIn.close();

        while (x >= 0) {
            System.out.println(x--);
            System.out.println("x의 값이" + x + "이 됐습니다.");
        }
    }
}
