/**
 =======================================================================================
 ------------------------------------- Problem 4-4 -------------------------------------
 2 개의 정숫값을 읽어서 두 정수 사이에 있는 모든 정숫값을 오름차순으로 표시한느 프로그램을 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 23
 28

 ------------------------------------- 출력(실행결과) -------------------------------------
 정수 A:
 정수 B:
 23 24 25 26 27 28

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap4.Solution;
import java.util.Scanner;

public class EnumScope {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        System.out.print("정수 A: ");
        int x = stdIn.nextInt();
        System.out.print("정수 B: ");
        int y = stdIn.nextInt();
        stdIn.close();

        if (x > y) {
            int temp = x;
            x = y;
            y = temp;
        }

        do {
            System.out.print(x + " ");
            x = x + 1;
        } while (x <= y);
        System.out.println();
    }
}
