/**
 =======================================================================================
 ------------------------------------- Problem 4-3 -------------------------------------
 2 자리의 정숫값(10~99)을 맞추는 '숫자 맞추기 게임' 을 작성하자.
 난수 생성과 if문 그리고 do-while문을 사용한다.

 ----------------------------------------- 입력 -----------------------------------------
 0

 ------------------------------------- 출력(실행결과) -------------------------------------
 숫자 맞추기 게임 시작!
 10부터 99 사이의 숫자를 맞추세요.
 어떤 숫자일까?: 84
 더 큰 숫자입니다.
 어떤 숫자일까?: 85
 정답입니다.

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap4.Solution;
import java.util.Random;
import java.util.Scanner;

// 숫자 맞추기 게임
public class Number2Digits {
    public static void main(String[] args) {
        Random rand = new Random();
        Scanner stdIn = new Scanner(System.in);

        int n = 10 + rand.nextInt(90);
        System.out.println("숫자 맞추기 게임 시작!");
        System.out.println("10부터 99 사이의 숫자를 맞추세요.");
        int x;
        do {
            System.out.print("어떤 숫자일까?: ");
            x = stdIn.nextInt();

            if (x > n) {
                System.out.println("더 적은 숫자입니다.");
            } else if (x < n) {
                System.out.println("더 큰 숫자입니다.");
            }
        } while( x != n);
        stdIn.close();
        System.out.println("정답입니다.");
    }
}
