/**
=======================================================================================
------------------------------------- Problem 4-2 -------------------------------------
3자리의 양의 정숫값(100~999)을 읽는 프로그램을 작성하라.
입력한 값이 3자리 양의 정숫값이 아니면 다시 입력한다.

----------------------------------------- 입력 -----------------------------------------
59
1052
235

------------------------------------- 출력(실행결과) -------------------------------------
세 자리의 정숫값:
세 자리의 정숫값:
세 자리의 정숫값:
입력한 값은 235입니다.

--------------------------------------- 에러 내용 ---------------------------------------
없음

=======================================================================================
*/
package Chap4.Solution;
import java.util.Scanner;

// 3자리의 양의 정숫값 읽기
class ThreeDigits {
    public static void main(String[] args) {
        Scanner stdIn = new Scanner(System.in);

        int x;
        do {
            System.out.print("세 자리의 정숫값: ");
            x = stdIn.nextInt();
        } while(x < 100 || x > 999);
        stdIn.close();

        System.out.println("입력한 값은 " + x + "입니다.");
    }
}
