/**
 =======================================================================================
 ------------------------------------- Problem 13-2 ------------------------------------
 Animal2 클래스를 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 없음

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap13.Solution;

abstract class Animal2 {
    private String name;

    public Animal2(String name) {
        this.name = name;
    }

    public abstract void bark();

    public String getName() {
        return name;
    }

    public abstract String toString();

    public void introduce() {
        System.out.print(toString() + "이다.");
        bark();
    }
}
