/**
 =======================================================================================
 ------------------------------------- Problem 13-5 ------------------------------------
 Player를 상속한 HumanPlayer 클래스를 작성하자.

 ----------------------------------------- 입력 -----------------------------------------
 없음

 ------------------------------------- 출력(실행결과) -------------------------------------
 없음

 --------------------------------------- 에러 내용 ---------------------------------------
 없음

 =======================================================================================
 */
package Chap13.Solution;
import java.util.Scanner;

public class HumanPlayer extends Player {
    private static Scanner stdIn;
    static {
        stdIn = new Scanner(System.in);
    }

    public int nextHand() {
        do {
            System.out.print("가위 바위 보! 0...가위/1...바위/2...보: ");
            hand = stdIn.nextInt();
        } while (hand < 0 || hand > 2);
        return hand;
    }
}
